"""
8. Дано два цілих числа: D (день) і M (місяць), що визначають правильну дату невисокосного року.
Вивести значення D і M для дати, що передує зазначеній.
"""


def main(x: int, y: int):
    if x == 1:
        if y in [5, 7, 10, 12]:
            x = 30
        elif y in [1, 2, 4, 6, 8, 9, 11]:
            x = 31
        else:
            x = 28
    else:
        x -= 1

    if x == 1:
        if y == 1:
            y = 12
        else:
            y -= 1
    return f"Попередня дата: місяць - {y}, день - {x};"


if __name__ == '__main__':
    m = int(input(f"Введіть порядковий номер місяця = "))
    d = int(input(f"Введіть порядковий номер дня = "))

    if 12 < m or m < 0:
        m = int(input(f"Введіть номер реального місяця = "))

    if m in [1, 3, 5, 7, 8, 10, 12]:
        if 31 < d or d < 0:
            d = int(input(f"Введіть день з множини (1-31) = "))

    elif m in [4, 6, 9, 11]:
        if 30 < d or d < 0:
            d = int(input(f"Введіть день з множини (1-30) = "))

    else:
        if 28 < d or d < 0:
            d = int(input(f"Введіть день з множини (1-28) = "))
    print(main(d, m))